<?php
//require_once 'bpmn1.php';
//if (callauto("A2")=="OK") {

echo "Starting many pages module!!!<br>";

$wps = array('Γνωμοδότηση Νομικής Επιτροπής ΑΠΘ','Πρόσληψη και Αποζημίωση Μεταπτυχιακών Φοιτητών και Υποψηφίων Διδακτόρων για Επικουρία Μελών ΔΕΠ','Έγκριση Οικονομικού Αιτήματος (ΑΠΘ)','Πρωτοκόλληση εγγράφων (ΑΠΘ)','Κλοπή (ΑΠΘ)','Διαδικασία Ελέγχου Δαπανών ΑΠΘ','Διαχείριση εισερχομένων - εξερχομένων εγγράφων','Πληρωμή Οδοιπορικών (Εφετείο Θεσσαλονίκης)','Οικονομική Διαχείριση (Δήμοι)','Κατατακτήριες Εξετάσεις Τμήματος Κινηματογράφου (ΑΠΘ)','Εκπαιδευτικές Άδειες Μελών ΔΕΠ','Διαδικασία κατατακτηρίων εξετάσεων','Μεμβράνες-Πτυχίο','Εκλογές Μελών ΔΕΠ στο Τμήμα Πολιτικών Μηχανικών ΑΠΘ','Αίτηση Μέλους ΔΕΠ για χορήγηση άδειας για επιστημονικούς λόγους','Μετατάξεις εκπαιδευτικών σε θέσεις Ε.ΔΙ.Π.','Άδεια Για Προσωπικούς Λόγους Μελών ΔΕΠ','Χορήγηση Πιστοποιητικού σε Φοιτητή/τρια Τμημάτων Α.Π.Θ.','Χορήγηση άδειας για προσωπικούς λόγους σε μέλη ΔΕΠ','Παλαιός Πίνακας υπηρεσιών','Εκπόνηση διδακτορικής διατριβής στο Τμήμα Αγρονόμων και Τοπογράφων Μηχανικών ΑΠΘ','Διαδικασία ορκωμοσίας φοιτητών Τμήματος Δασολογίας και Φυσικού Περιβάλλοντος ΑΠΘ','Κατατακτήριες Εξετάσεις','Φοιτητικό Στεγαστικό Επίδομα - Νομική Σχολή Α.Π.Θ.','Διακοπή Φοίτησης','Αναγνώριση Μαθήματος','Δοκιμαστικό διαδικασίας κρίσης','Εξέλιξη Μέλους ΔΕΠ','Εκπόνηση Διδακτορικής Διατριβής','Ανάθεση Αυτοδύναμου Διδακτικού Έργου σε μέλος ΕΔΙΠ','Διαδικασία Τμήματος Σχολαζουσών Κληρονομιών','Κατατακτήριες Εξετάσεις-Τμήμα Οικονομικών Επιστημών ΑΠΘ','Ορκωμοσία Πτυχιούχων Π.Τ.Δ.Ε. - Α.Π.Θ.','Αλλαγή γνωστικού αντικειμενου','Διδακτορική Διατριβή ΤΕΠΑΕ (ΑΠΘ)','Πρακτική Άσκηση φοιτητών Τμήματος Φαρμακευτικής ΑΠΘ','Προγραμματικές Συμβάσεις ΟΠΑΝΔΑ','Υποστήριξη και Λειτουργία Τμήματος (Δήμοι)','Παρακολούθηση Ταμειακών Λογαριασμών (Δήμοι)','Έκδοση Γραμματίων Είσπραξης','Είσπραξη Εσόδων δια Βεβαιωτικών Καταλόγων και Οίκοθεν Βεβαιωτικών Σημειωμάτων Επιμελ. Εισπρακτ.','Είσπραξη Ημερήσιων Τακτοποιητέων Εισπράξεων','Πληρωμή ΧΕΠ Μισθοδοσίας Εργαζομένων','Πληρωμή Ενταλμάτων Προμηθευτών (Δήμοι)','Δοκιμαστική σελίδα κατηγοριοποίησης','Απόδοση Κρατήσεων -Εισφορών υπέρ Τρίτων Μισθοδοσίας','Έλεγχος ΧΕΠ/ΧΕΠΕΛ Προμηθευτών','Απευθείας Ανάθεση Προμηθειών ή Υπηρεσιών','Διοργάνωση Πολιτιστικών Εκδηλώσεων','Νέος Πίνακας Υπηρεσιών','Παραίτηση Εκπαιδευτικών Π.Ε. για Λόγους Υγείας ή Οικογενειακούς Λόγους:Δοκιμή 2','Απευθείας Ανάθεση Έργου (ΑΠΘ):Δοκιμή 2','Έκδοση Άδειας Οδήγησης Αγροτικού Μηχανήματος:Δοκιμή 2','Έκδοση Τίτλου Αναδασμού:Δοκιμή 2','Χορήγηση Πιστοποιητικού ΕΝ.Φ.Ι.Α.:Δοκιμή 2','Διαχείριση Προνοιακού Επιδόματος Αιματολογικών Παθήσεων','Αναπλάσεις - Διαμορφώσεις Χώρων Πρασίνου με Αυτεπιστασία','Κανονισμός Λειτουργίας Παιδικών Σταθμών','Διαχείριση αρχείων','Διαχείριση θεμάτων Προσωπικού','Παραχώρηση χώρων υπηρεσιών πολιτισμού','Παραχώρηση χώρων Βαφοπούλειου Πνευαμτικού Κέντρου για διοργάνωση εικαστικών εκθέσεων','Διαχείριση τηλεφωνημάτων','ΜΕΤΕΓΓΡΑΦΕΣ ΦΟΙΤΗΤΩΝ','Διαχείριση προνοιακού επιδόματος ειδικών αναγκών','Ορισμός Επιτροπών Σχετικά με την Προμήθεια Αγαθών και Ανάθεση Εργασιών - Έργων','Αρχειοθέτηση και Διακίνηση των Εγγράφων','Υποβολή Λογαριασμού Έργου','Γνωμοδοτήσεις Τεχνικού Συμβουλίου','Ηλεκτρονική διαχείριση εγγράφων-docs.auth','Προγραμματισμός Java','Εκδοση Εκπαιδευτικών Αδειών','Έκδοση Αδειών Μελών ΔΕΠ ΑΠΘ'); 

$i = 0;
foreach ($wps as $value) {
$i = $i+1;
    echo "$value <br>";
$w = "<script>window.open('http://imagnisa.labs.ihu.edu.gr/mw/BPMN/bpmn1.php?auto=1&wp=".$value."');</script>";
echo $w;
echo "Another page opened!!!-->".$i."<br>";
}

//$in ="A2";
//$w = "<script>window.open('http://imagnisa.labs.ihu.edu.gr/mw/BPMN/bpmn1.php?auto=1&wp=".$in."');</script>";
//echo $w;
//$in ="Χορήγηση_Βεβαίωσης_Μόνιμης_Κατοικίας";
//$w = "<script>window.open('http://imagnisa.labs.ihu.edu.gr/mw/BPMN/bpmn1.php?auto=1&wp=".$in."');</script>";
//echo $w;
//callauto("A2");
//    callauto("Χορήγηση_Βεβαίωσης_Μόνιμης_Κατοικίας");
//}

echo "finiished!!! - I opened one windiw for each wikii page to process....";
?>